In [1]:
import pandas as pd
import numpy as np
import os
import time
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [17]:
path = os.path.abspath(os.path.join(os.path.dirname('FunnelAnalysis.ipynb'),
                                    os.pardir,
                                    'RawData',
                                    'Funnel'))

## 1. User Table Overview

In [19]:
user = pd.read_csv(os.path.join(path,'user_table.csv'))
print(user.shape)
user.head()

(90400, 4)

   user_id        date   device     sex
0   450007  2015-02-28  Desktop  Female
1   756838  2015-01-13  Desktop    Male
2   568983  2015-04-09  Desktop    Male
3   190794  2015-02-18  Desktop  Female
4   537909  2015-01-15  Desktop    Male

In [20]:
user.tail()

       user_id        date   device     sex
90395   307667  2015-03-30  Desktop  Female
90396   642989  2015-02-08  Desktop  Female
90397   659645  2015-04-13  Desktop    Male
90398   359779  2015-03-23  Desktop    Male
90399   438929  2015-03-26   Mobile  Female

In [22]:
# check if user id is unique in this table
user.user_id.nunique()

90400

In [23]:
# check date range
print(user.date.max())
print(user.date.min())

2015-04-30
2015-01-01

In [27]:
# check the device type
user.device.value_counts(dropna=False,normalize=True)

Desktop    0.665929
Mobile     0.334071
Name: device, dtype: float64

In [28]:
# check the sex distribution
user.sex.value_counts(dropna=False,normalize=True)

Male      0.501383
Female    0.498617
Name: sex, dtype: float64

## 2. Home Page

In [29]:
hp = pd.read_csv(os.path.join(path,'home_page_table.csv'))
print(hp.shape)
hp.head()

(90400, 2)

   user_id       page
0   313593  home_page
1   468315  home_page
2   264005  home_page
3   290784  home_page
4   639104  home_page

In [30]:
hp.tail()

       user_id       page
90395   456851  home_page
90396   128619  home_page
90397   167290  home_page
90398   437765  home_page
90399   337840  home_page

In [32]:
# check if user_id unique
hp.user_id.nunique()

90400

In [33]:
# check if all home_page
hp.page.value_counts(dropna=False)

home_page    90400
Name: page, dtype: int64

## 3. Search Page

In [34]:
sp = pd.read_csv(os.path.join(path,'search_page_table.csv'))
print(sp.shape)
sp.head()

(45200, 2)

   user_id         page
0    15866  search_page
1   347058  search_page
2   577020  search_page
3   780347  search_page
4   383739  search_page

In [35]:
sp.tail()

       user_id         page
45195   417880  search_page
45196   989982  search_page
45197   428806  search_page
45198   609493  search_page
45199   303221  search_page

In [36]:
# check if user_id unique
sp.user_id.nunique()

45200

In [37]:
# check if all search page
sp.page.value_counts(dropna=False)

search_page    45200
Name: page, dtype: int64